47-Auth/server/app/controllers/api/v1/auth_controller.rb

    def create
        # byebug
        user = User.find_by(username: params[:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "vidhi03"], ["LIMIT", 1]]